// composables/dashboard/useNavigation_Profile.ts
export const useNavigationProfile = () => {
  const menuGroupsProfile = [
    {
      title: 'ระบบการสั่งซื้อ',
      icon: '🛒',
      links: [ 'รายการสั่งซื้อทั้งหมด', 'รายการสินค้าค้างส่ง', 'ใบสั่งซื้อย้อนหลัง' ]
    },
    {
      title: 'การเงินและชำระเงิน',
      icon: '💳',
      links: ['ชำระ / อัปโหลดหลักฐานโอน', 'ชำระหนี้ Advice สนญ.', 'รายการเคลื่อนไหวบัญชี']
    },
    {
      title: 'งานบริการและติดตามสถานะและเคลม',
      icon: '📦',
      links: ['ตรวจสอบสถานะการแจ้งเคลม', 'สินค้าเคลมรอตัดสินใจ', 'รายงานการส่งคืน']
    },
    {
      title: 'ข้อมูลและการตั้งค่า',
      icon: '⚙️',
      links: [ 'ข้อมูลส่วนตัวดีลเลอร์', 'รายขื่อไฟล์ที่อัปโหลด', 'เงื่อนไขการจัดส่ง', 'เปลี่ยนรหัสผ่าน']
    }
  ];

  return { menuGroupsProfile };
};
